[
  {
    "path": "posts/2021-03-25-insurance-charges-in-the-united-states/",
    "title": "Insurance Charges in the United States",
    "description": {},
    "author": [
      {
        "name": "Mikaela Mazey",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-03-25",
    "categories": [],
    "contents": "\n\n\n\nMedical Insurance Charges in the United States\nSince I am from Canada, and we pay for our medical bills through taxes, I was curious to analyze the insurance charges in the United States. I created a few visualizations that shows the data in a comprehensive way. I found this dataset in Kaggle and can be found here. The dataset does not give reference to what years the data represents, but I still found the data insightful.\n\n\n\nFrom this visualization, we can see the variation of insurances charges for both genders. We identify that there is a spike for medical insurance charges from the ages 18-20 for both genders. The insurance charges somewhat average out and then get higher at around the age of 45. This makes perfect sense: As people age, their insurance charges increase. I also found the initial spike interesting, but this also makes sense as young adults are more reckless with their actions.\n\n\n\nI created this plot to see which gender has the higher medical insurance charges. After I created this boxplot, I realized how close they are when comparing the medians. However, we can see that males tend to have higher medical insurance bills when compared to females.\n\n\n\nI then wanted to take a look at the different regions in the United States. I was curious to see if there was a specific region that had higher medical insurance costs. I wanted to compare between males and females and we can see that for both genders, the Southeast region has the highest insurance charges.\n\n\n\nFrom these plots, we can see that as BMI (Body Mass Index) increases, so do insurance charges. We can also see that males have a steeper slope, showing that they have higher insurance charges based off their BMI.\n\n\n\n",
    "preview": "posts/2021-03-25-insurance-charges-in-the-united-states/insurance-charges-in-the-united-states_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2021-04-02T20:45:43-06:00",
    "input_file": "insurance-charges-in-the-united-states.utf8.md",
    "preview_width": 1248,
    "preview_height": 768
  }
]
